#+TITLE: Incremental Learning
#+FILETAGS: PERSONAL @sideproject LEARN

toss coin to choose topics to learning

Just run the block below when I don't have any strong preference on which of these to learn.

#+BEGIN_QUOTE
Understanding triggers of your hesitation are keys to understand collections of preferences, called self.
#+END_QUOTE
Basically, if I hestitate to do what the coin tells you, just redo it.

Toss the coin by running the code below
#+BEGIN_SRC python :results output
topics = ["Emacs", "Blockchain", "Algorithm", "Prompt Programming", "Deep Learning and Data Science"]
import random

# return random.choice(topics)
print(random.choice(topics))
#+END_SRC


**** TODO LEARNING what exactly does doom sync do? I feel like this is a part of the puzzle that, sometimes, my own config doesn't load properly after doom/reload.
:LOGBOOK:
CLOCK: [2022-02-20 Sun 14:30]--[2022-02-20 Sun 14:34] =>  0:04
CLOCK: [2022-02-20 Sun 14:27]--[2022-02-20 Sun 14:30] =>  0:03
CLOCK: [2022-02-20 Sun 13:46]--[2022-02-20 Sun 14:27] =>  0:41
CLOCK: [2022-02-20 Sun 13:42]--[2022-02-20 Sun 13:45] =>  0:03
CLOCK: [2022-02-20 Sun 13:39]--[2022-02-20 Sun 13:40] =>  0:01
CLOCK: [2022-02-20 Sun 13:27]--[2022-02-20 Sun 13:38] =>  0:11
CLOCK: [2022-02-20 Sun 13:26]--[2022-02-20 Sun 13:27] =>  0:01
:END:
[2022-02-20 Sun 13:26]
***** LEARNING learn about the following org-model. org-crypt, org-gnus, org-bbdb, org-irc, org-
:LOGBOOK:
CLOCK: [2022-02-20 Sun 13:38]--[2022-02-20 Sun 13:39] =>  0:01
:END:
[2022-02-20 Sun 13:38]
#+BEGIN_SRC emacs-lisp
(setq org-modules (quote (org-bbdb
                          org-bibtex
                          org-crypt
                          org-gnus
                          org-id
                          org-info
                          org-jsinfo
                          org-habit
                          org-inlinetask
                          org-irc
                          org-mew
                          org-mhe
                          org-protocol
                          org-rmail
                          org-vm
                          org-wl
                          org-w3m)))
#+END_SRC
***** TODO learn about org sidebar. Can I integrated into my work flow? :emacs:garun:
:LOGBOOK:
CLOCK: [2022-02-22 Tue 09:55]--[2022-02-22 Tue 09:56] =>  0:01
:END:
[2022-02-22 Tue 09:55]
**** TODO figure out how to use org category? how can I use org category with tags? read the =norang= for examples.
:LOGBOOK:
CLOCK: [2022-02-22 Tue 09:59]--[2022-02-22 Tue 10:00] =>  0:01
:END:
[2022-02-22 Tue 09:59]
*** TODO begin reading data science at commandline 2nd (https://mail.google.com/mail/u/0/#inbox/FMfcgzGmvBpgRLhhLPHmKxjwSSmdxMJF)
:LOGBOOK:
CLOCK: [2022-02-24 Thu 11:12]--[2022-02-24 Thu 11:13] =>  0:01
:END:
[2022-02-24 Thu 11:12]
[[file:~/org/school.org::*check my exam dates][check my exam dates]]
*** TODO build my own database where I can query dataset from different machine to do data analysis. try out Amazon Athena. (what is it used for? what are other alternative?)
:LOGBOOK:
CLOCK: [2022-02-24 Thu 18:17]--[2022-02-24 Thu 18:18] =>  0:01
:END:
[2022-02-24 Thu 18:17]
[[file:~/org/PhD.org::*Meeting][Meeting]]
*** TODO search for books on windowing system (e.g. xwindow system, wayland) the goal is to understand windowing system enough to manipulate it with my wsl2.
:LOGBOOK:
CLOCK: [2022-02-25 Fri 11:50]--[2022-02-25 Fri 11:51] =>  0:01
:END:
[2022-02-25 Fri 11:50]
*** TODO plan out how to implement my own server. including buying server and setting things up.
:LOGBOOK:
CLOCK: [2022-02-26 Sat 14:34]--[2022-02-26 Sat 14:35] =>  0:01
:END:
[2022-02-26 Sat 14:34]
[[file:~/org/todo.org::*start daily writing and reading. (checkout template that I made for roam research to used as a building block. dont reinvent the wheel, but adjust things accordingly.)][start daily writing and reading. (checkout template that I made for roam research to used as a building block. dont reinvent the wheel, but adjust things accordingly.)]]
